#Область ПрограммныйИнтерфейс

Функция ПолучитьДанныеДиалогаИзРегистра(СсылкаДиалога) Экспорт
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат Неопределено;
	КонецЕсли;
	МенеджерЗаписи = РегистрыСведений.ИИА_ДанныеДиалогов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Диалог = СсылкаДиалога;
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(МенеджерЗаписи.ХранилищеЗначения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		Данные = МенеджерЗаписи.ХранилищеЗначения.Получить();
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Возврат Данные;
		КонецЕсли;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	Возврат Неопределено;
КонецФункции

Процедура ЗаписатьДанныеДиалогаВРегистр(СсылкаДиалога, СтруктураДанных) Экспорт
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) ИЛИ СсылкаДиалога.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	МенеджерЗаписи = РегистрыСведений.ИИА_ДанныеДиалогов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Диалог = СсылкаДиалога;
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Диалог = СсылкаДиалога;
		МенеджерЗаписи.ОркестраторВключен = Ложь;
		МенеджерЗаписи.ХранилищеЗначения = Новый ХранилищеЗначения(СтруктураДанных);
	Иначе
		СохранитьОркестратор = МенеджерЗаписи.ОркестраторВключен = Истина;
		МенеджерЗаписи.ХранилищеЗначения = Новый ХранилищеЗначения(СтруктураДанных);
		МенеджерЗаписи.ОркестраторВключен = СохранитьОркестратор;
	КонецЕсли;
	МенеджерЗаписи.Записать();
КонецПроцедуры

#КонецОбласти
